# DuplicateModuleName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MacroFailures..::..DuplicateModuleName Property
BuiltInFailures..::..MacroFailures Class See Also
---
Macro project with name [MacroModuleName] duplicates with central file. Delete the macro project or re-create it with another name to proceed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DuplicateModuleName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuplicateModuleName As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DuplicateModuleName {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MacroFailures Class
Autodesk.Revit.DB Namespace